{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_1", "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"trainable": true, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_1", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_2", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_3", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_4", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_5", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_6", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]], [["conv2d_7", 0, 0, {}]], [["conv2d_8", 0, 0, {}]], [["conv2d_9", 0, 0, {}]]]}, {"config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_7", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["activation_1", 1, 0, {}]]]}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_8", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"config": {"trainable": true, "interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["activation_1", 2, 0, {}]]]}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_4"}, "class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_9", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "sigmoid", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "out_mask", "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "filters": 2}, "class_name": "Conv2D", "name": "out_mask", "inbound_nodes": [[["activation_1", 3, 0, {}]]]}, {"config": {"trainable": true, "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "out_tags", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "out_tags", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}], "output_layers": [["out_mask", 0, 0], ["out_tags", 0, 0]]}, "class_name": "Model"}, "training_config": {"sample_weight_mode": null, "loss": "binary_crossentropy", "metrics": {"out_tags": "binary_accuracy"}, "loss_weights": null, "optimizer_config": {"config": {"rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07, "lr": 0.00010000000474974513}, "class_name": "RMSprop"}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [16], "dtype": "float32"}, {"name": "out_mask/kernel", "shape": [3, 3, 16, 2], "dtype": "float32"}, {"name": "out_mask/bias", "shape": [2], "dtype": "float32"}, {"name": "out_tags/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "out_tags/bias", "shape": [2], "dtype": "float32"}]}]}